Trying to fix the mermaid diagram
